Update on networking technical manual
